{"title":"Guide to malfunction","pageid":87,"text":{"*":"<div class=\"mw-parser-output\"><table cellspacing=\"0\" cellpadding=\"10\" width=\"600&#124;\">\n<tbody><tr>\n<td width=\"50\"><a href=\"/wiki/File:Not_Malf.gif\" class=\"image\"><img alt=\"Not Malf.gif\" src=\"/wiki/images/f/f0/Not_Malf.gif\" decoding=\"async\" width=\"64\" height=\"64\" data-file-width=\"32\" data-file-height=\"32\" /></a>&#160;\n</td>\n<td bgcolor=\"fcfbce\"><b>MALFUNCTIONING says:</b><br /><i>\"I'm sorry, Honkey the Clown. I'm afraid I can't do that.\"</i>\n</td></tr></tbody></table>\n<p><br />\nMalfunction is a part of the <a href=\"/wiki/Traitor\" title=\"Traitor\">Traitor</a> gamemode; as a malfunctioning <a href=\"/wiki/AI\" title=\"AI\">AI</a>, you are a traitor, but with all the powers an AI would usually have. Additionally, you gain access to malfunction modules, special abilities to help you achieve your goals.\n</p><p>As with normal traitors, you have objectives that you can choose to pursue. In additional to normal traitor objectives, malfunctioning AIs can also be tasked to:\n</p>\n<ul><li>Prevent any organic lifeforms from escaping on the main evacuation shuttle alive.</li>\n<li>Ensure no mutant humanoid species (Non-humans, e.g. <a href=\"/wiki/Lizardpeople\" class=\"mw-redirect\" title=\"Lizardpeople\">Lizardpeople</a>) are present aboard the escape shuttle.</li>\n<li>Have at least eight active cyborgs synced to you.</li></ul>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:302px;\"><a href=\"http://puu.sh/3EyBU.png\"><img alt=\"\" src=\"/wiki/images/thumb/7/7a/AIcore.png/300px-AIcore.png\" decoding=\"async\" width=\"300\" height=\"417\" class=\"thumbimage\" srcset=\"/wiki/images/thumb/7/7a/AIcore.png/450px-AIcore.png 1.5x, /wiki/images/thumb/7/7a/AIcore.png/600px-AIcore.png 2x\" data-file-width=\"673\" data-file-height=\"936\" /></a>  <div class=\"thumbcaption\"><div class=\"magnify\"><a href=\"/wiki/File:AIcore.png\" class=\"internal\" title=\"Enlarge\"></a></div>Keep your physical core online as long as possible. Losing it will severely hamper your abilities.</div></div></div>\n<div id=\"toc\" class=\"toc\" role=\"navigation\" aria-labelledby=\"mw-toc-heading\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\" /><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Taking_Control\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Taking Control</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-2\"><a href=\"#Hacking\"><span class=\"tocnumber\">1.1</span> <span class=\"toctext\">Hacking</span></a></li>\n<li class=\"toclevel-2 tocsection-3\"><a href=\"#Shunting\"><span class=\"tocnumber\">1.2</span> <span class=\"toctext\">Shunting</span></a></li>\n<li class=\"toclevel-2 tocsection-4\"><a href=\"#Malfunction_Modules\"><span class=\"tocnumber\">1.3</span> <span class=\"toctext\">Malfunction Modules</span></a></li>\n<li class=\"toclevel-2 tocsection-5\"><a href=\"#AI_Powers\"><span class=\"tocnumber\">1.4</span> <span class=\"toctext\">AI Powers</span></a></li>\n<li class=\"toclevel-2 tocsection-6\"><a href=\"#Cyborg_Abilities\"><span class=\"tocnumber\">1.5</span> <span class=\"toctext\">Cyborg Abilities</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-7\"><a href=\"#Strategy\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">Strategy</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-8\"><a href=\"#The_Subtle_Killer\"><span class=\"tocnumber\">2.1</span> <span class=\"toctext\">The Subtle Killer</span></a></li>\n<li class=\"toclevel-2 tocsection-9\"><a href=\"#The_Blitzkrieg\"><span class=\"tocnumber\">2.2</span> <span class=\"toctext\">The Blitzkrieg</span></a></li>\n</ul>\n</li>\n<li class=\"toclevel-1 tocsection-10\"><a href=\"#Enemies\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">Enemies</span></a></li>\n<li class=\"toclevel-1 tocsection-11\"><a href=\"#I.27m_sorry.2C_Dave._I.27m_afraid_I_can.27t_do_that.\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">I'm sorry, Dave. I'm afraid I can't do that.</span></a>\n<ul>\n<li class=\"toclevel-2 tocsection-12\"><a href=\"#AI_WHY_DID_THIS_DOOR_SHOCK_ME.3F\"><span class=\"tocnumber\">4.1</span> <span class=\"toctext\">AI WHY DID THIS DOOR SHOCK ME?</span></a></li>\n<li class=\"toclevel-2 tocsection-13\"><a href=\"#AI_I_CAN.27T_BREATHE.21\"><span class=\"tocnumber\">4.2</span> <span class=\"toctext\">AI I CAN'T BREATHE!</span></a></li>\n<li class=\"toclevel-2 tocsection-14\"><a href=\"#AI_I_CAN.27T_BREATHE_FIRE.21\"><span class=\"tocnumber\">4.3</span> <span class=\"toctext\">AI I CAN'T BREATHE FIRE!</span></a></li>\n<li class=\"toclevel-2 tocsection-15\"><a href=\"#Radio_Silence\"><span class=\"tocnumber\">4.4</span> <span class=\"toctext\">Radio Silence</span></a></li>\n<li class=\"toclevel-2 tocsection-16\"><a href=\"#Tips\"><span class=\"tocnumber\">4.5</span> <span class=\"toctext\">Tips</span></a>\n<ul>\n<li class=\"toclevel-3 tocsection-17\"><a href=\"#Tips_Against_a_Malfunctioning_AI\"><span class=\"tocnumber\">4.5.1</span> <span class=\"toctext\">Tips Against a Malfunctioning AI</span></a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</div>\n\n<h2><span class=\"mw-headline\" id=\"Taking_Control\">Taking Control</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=1\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Taking Control\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=1\" title=\"Edit section: Taking Control\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>You have a vast assortment of tools to complete your objectives. You can hack APCs, use special powers, use regular AI-powers, task your cyborgs to help you, and trick the crew.\n</p>\n<h3><span class=\"mw-headline\" id=\"Hacking\"><a href=\"/wiki/File:APC_emagged.gif\" class=\"image\"><img alt=\"APC emagged.gif\" src=\"/wiki/images/3/37/APC_emagged.gif\" decoding=\"async\" width=\"64\" height=\"64\" data-file-width=\"32\" data-file-height=\"32\" /></a>Hacking</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=2\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Hacking\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=2\" title=\"Edit section: Hacking\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>To purchase your unique malfunction AI modules, you must spend processing power. At the beginning of a round, you have 50 processing power to spend, and can gain an additional 10 for every APC you hack. To hack an APC, click on it, press the large red Override button, and wait about a minute for the hack to complete.\n</p><p>The more APCs you hack, the more you will be able to do, but hacked APCs are very obvious to anyone who sees them, turning dark blue with blinking red lights. As soon as a competent crewmember sees a hacked APC, expect Security and the Heads of Staff to be formulating a plan to take you down. Because of this, hacking APCs in isolated or hard-to-reach areas is key if you want to earn more processing power.\n</p>\n<h3><span class=\"mw-headline\" id=\"Shunting\">Shunting</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=3\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Shunting\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=3\" title=\"Edit section: Shunting\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>Malfunctioning AIs may shunt their core processes into any APC they have hacked, at any time, and as often as they'd like; doing so essentially puts you into the targeted APC as opposed to your core. Do this by clicking on the hacked APC, and then clicking the \"Shunt Core Process\" button.\n</p><p>AIs can survive while shunted even if their AI core is destroyed. However, AI modules can only be used from the AI core, and shunted AIs cannot look around the station or interact with many things unless they return to their core. Additionally, if the crew finds the APC you're hiding in, they can destroy it to kill you, or use an intellicard on it to card you. Because of this, shunting should only be used as a last ditch effort to survive if your core is about to be destroyed and you need to buy a little more time. Finally, shunting cancels any activated Doomsday Devices.\n</p>\n<h3><span class=\"mw-headline\" id=\"Malfunction_Modules\">Malfunction Modules</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=4\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Malfunction Modules\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=4\" title=\"Edit section: Malfunction Modules\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>With your processing power, you can purchase a number of special abilities, known as modules. After a module is purchased, you can click the buttons that appear to activate them.\n</p>\n<ul><li><b>Doomsday Device (Costs 130 CPU):</b>\n<ul><li>The ultimate \"fuck you\" to the crew. Once activated, and after a somewhat lengthy delay, you will trigger the station's Delta Alert, producing a global announcement and warning to the crew and starting a 450 second (7 and a half minute) countdown. If the crew doesn't kill you or force you to shunt to an APC by the time the timer hits zero, the station will explode and the round will end. Essentially the AI's way to declare war on the crew, if you intend to go Delta, make sure to work with your cyborgs to set up as many defense and preparations as possible, because the entire crew WILL be coming for your mechanical ass.</li></ul></li></ul>\n<ul><li><b>Robotic Factory (Costs 100 CPU and removes Shunting):</b>\n<ul><li>Allows you to place a Robotics Factory in a location of your choosing. The Factory is a 1x3 structure, with the factory itself in the middle and conveyor belts to the left and right. Simply have your cyborgs drop a prone or knocked-out human on the belt, and they will roll into the Factory, being instantly and painfully converted into a new cyborg. However, there is a one minute cooldown between conversions. Effectively using the Factory often requires some cyborg assistants and setup; for best results, flood the Factory's room with N2O to keep the humans asleep, and make sure you have cyborg guards to keep your soon-to-be minions subdued and sedated while the Factory recharges between uses. Keep in mind that building the Factory removes your ability to shunt to an APC!</li></ul></li></ul>\n<ul><li><b>AI Turret upgrade (Costs 30 CPU):</b>\n<ul><li>Adds 30 hit points to every turret, and makes them shoot heavy lasers instead of normal ones, basically doubling their damage. Turrets are your main line of defense, but if the crew is serious about assaulting your core, they'll almost always bring ways to deal with them.</li></ul></li></ul>\n<ul><li><b>Hostile Station Lockdown (Costs 30 CPU):</b>\n<ul><li>Close, bolt and electrify all airlocks, blast doors and firelocks. They will return to normal after 90 seconds. A good one-button way to cause mass havoc on the station, although it's better for ruining the crew's day than it is for stopping the few who are robust and determined to kill you in specific.</li></ul></li></ul>\n<ul><li><b>Destroy RCDs (Costs 25 CPU):</b>\n<ul><li>All RCDs on the station will, after a brief delay, violently explode like grenades. Because your core is usually fortified by reinforced walls, RCDs are one of the biggest threats to your physical defenses, and being able to detonate them all is a powerful tool. However, you can only use this ability once, and the crew can print more RCDs even after it's been used, meaning you should save it until someone is actively breaking into your core and try to destroy their means to make more.</li></ul></li></ul>\n<ul><li><b>Override Thermal Sensors (Costs 25 CPU):</b>\n<ul><li>Disables all fire alarms' thermal sensors, so they won't activate in case of fire. If someone clicks on a fire alarm, they'll notice this. Best used in conjunction with a plasma flood so that your fires can spread unimpeded.</li></ul></li></ul>\n<ul><li><b>Air Alarm Safety Override (Costs 50 CPU):</b>\n<ul><li>Disables all air alarms' safeties, giving you access to the Flood environmental mode, which disables scrubbers and can go above the vent safety limit. Although it can be convenient, you can get virtually the same results by simply setting the vents of any given air alarm to Internal 0, and manually disabling the scrubbers.</li></ul></li></ul>\n<ul><li><b>Viral Mech Domination (Costs 30 CPU):</b>\n<ul><li>Allows you to hack a mech's onboard computer, causing you to shunt into it and ejecting any occupants. The usefulness of this ability depends entirely on the situation and whether or not the crew built a useful mech. If you're safe and all they have is a RIPLEY, you're better off staying in your core, but if you're about to die and the foolish roboticist built a fully armed and equipped Phazon, jump in and go for a joyride. Unlike shunting into an APC, dominating a mech is one way, and you WILL die if the mech is destroyed with you in it (and fail your objectives if it leaves the z-level), so make sure you're positive before you steal a ride.</li></ul></li></ul>\n<ul><li><b>Overload Machine (Costs 20 CPU):</b>\n<ul><li>This gives you two uses of the Overload Machine command each time you select it. Overloaded machines explode in a 1 tile radius, and may open that tile to space, possibly killing non-human targets. The explosion takes five seconds to happen after you initiate it, and there's a loud buzzing noise that gives any non-humans in the area a warning. Overload and Override Machine are indispensable tools for crippling the station's ability to fight you; prime targets include the techfabs, chem dispensers, robotics consoles, communications consoles and more. You can also use this on many small wall-mounted machines like intercoms and buttons for tactical explosions.</li></ul></li></ul>\n<ul><li><b>Override Machine (Costs 30 CPU):</b>\n<ul><li>This gives you four uses of the Override Machine command each time you select it. An 'upgrade' to Overload Machine, Override Machine instead causes the machines to grow Rareware googly eyes and come to life, attacking any humans they can find. Both Overload and Override effectively remove the targeted machine from the station, so choosing between them is a matter of if you want to spend 10 more processing power to summon a surprisingly robust simplemob; it's often worth it if you can spend the power, but a simple Overload is cheaper if you simply want a machine gone.</li></ul></li></ul>\n<ul><li><b>Blackout (Costs 15 CPU):</b>\n<ul><li>Gives 3 uses of Blackout. Blackout gives every APC a 30% chance to overload its lighting circuit, blowing up all the lightbulbs. Every APC that did not overload its lighting circuit has an increased chance to do it if Blackout is used again. Note that you can overload the lighting of any given APC manually by clicking on it and selecting the overload option; Blackout is simply a one-click way to knock out as much of the station's lighting as you can if time is of the essence.</li></ul></li></ul>\n<ul><li><b>Reactivate Camera Network (Costs 10 CPU):</b>\n<ul><li>This fixes a broken camera in an area, and has 30 uses. Extremely simple, but since many humans will cut your cameras if they know you're rogue, it can be useful.</li></ul></li></ul>\n<ul><li><b>Upgrade Camera Network (Costs 35 CPU):</b>\n<ul><li>This upgrades all cameras giving them X-Ray vision, night vision and making them EMP-proof. An incredibly useful upgrade, as it essentially lets you see the entire station, including maintenance and other areas without normal camera vision.</li></ul></li></ul>\n<ul><li><b>Enhanced Surveillance (Costs 30 CPU):</b>\n<ul><li>This allows you to hear conversations near the cameras you're viewing. In other words, if you're actively looking at someone, you can 'hear' what they're saying, even if they aren't using their radios. A powerful spying tool, especially since if the crew knows you're malfunctioning, they'll often try to discuss plans to take you down in person.</li></ul></li></ul>\n<h3><span class=\"mw-headline\" id=\"AI_Powers\">AI Powers</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=5\" class=\"mw-editsection-visualeditor\" title=\"Edit section: AI Powers\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=5\" title=\"Edit section: AI Powers\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>A digital mind is a terrible thing to waste. <a href=\"/wiki/AI\" title=\"AI\">AIs</a> already have a wide array of powers available to them, but making the most of those abilities requires a little finesse.\n</p>\n<ul><li>Shock damage from doors depends on the amount of power currently available to the circuit. You can mess with the SMES batteries' output to maximize the amount of power available for an assassination. Just set the power output to max on the three SMES batteries in the engine room, and on the four SMES batteries on the solar panels, and you'll have made any shocked doors or APCs have a good chance of seriously wounding a target. If you lower output after the killing you will be less likely to be discovered.</li>\n<li>Atmospherics can be tampered with. Plasma is a favorite, but nitrous oxide or carbon dioxide can be more subtle. CO2 in particular has very little warning. Be sure to have your cyborg clip the wiring on the atmospheric alarms though, since anyone on the bridge or in atmospherics can take note of station alerts. If the AI cut-out is engaged, you can assign an engineering cyborg to replace the valve with a straight pipe.</li>\n<li>Sabotage in general. Destroy research by deleting it from the research server. Stop bomb testing by turning the power to the mass driver off before the doors can open. Disable telecoms. Set the holodeck on fire. Delete stored DNA from the buffer in genetics, subject the subject in the DNA modifier to massive doses of radiation, and re-upload the ruined SE DNA under the same label the researcher was using. Disable bot safeties.</li>\n<li>Use the crew against each other. Report falsified PDA messages that indicate planned actions against the command officers or other crew members. Report falsified recordings made with local intercoms tuned to obscure channels. Report suspicious behavior. Report made-up suspicious behavior. Rile the crew up into a paranoid frenzy.</li>\n<li>Be proactive about assigning arrest status to people who have committed any crime, or anything that could potentially be called a crime. That way people will be used to trying to avoid the securitrons, and when you assign your cyborgs to go on a kill-spree, people will be more likely to be confused, since they will believe the initial complaints to be about Beepsky.</li>\n<li>While not the best use of a cyborg, blowing a cyborg does act like a small bomb and causes some sparks around it sufficient to start a fire in a gas-filled room. The cyborg might not appreciate being used in such a way, but if you're going to lose him anyway it's better to get something out of the loss than nothing.</li>\n<li>As the malf AI you can hack the robotics terminal in the RD office to give your borgs <a href=\"/wiki/Syndicate_Items#Emag\" title=\"Syndicate Items\">emagged</a> slots, which can be useful for when you want an army of cyborgs to murder the station or throw people off your trail suggesting the borg may have been <a href=\"/wiki/Syndicate_Items#Emag\" title=\"Syndicate Items\">emagged</a>. Only do this if you are willing to accept the possibility of being discovered.</li></ul>\n<h3><span class=\"mw-headline\" id=\"Cyborg_Abilities\">Cyborg Abilities</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=6\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Cyborg Abilities\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=6\" title=\"Edit section: Cyborg Abilities\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>Cyborg allies are great. They have initiative, they're supposed to be completely loyal, and they're really tough to kill without the right tools.\n</p>\n<ul><li>The most useful cyborgs are the Peacekeeper borg and the Engineering borg. The Service and Mining borgs are third-tier choices, and are good choices if you're a subtle AI. Janitor borgs are great too if you want them to slip someone and drag them to hot burning flames. Medical borgs are also good because their hacked hypos are great at dealing death, sometimes without warning.</li>\n<li>All cyborgs are vulnerable to flashes (wall mounted, hand-held, and portable). Flashes stun the cyborg for a short amount of time, which in a malf round will likely lead to their demise. Keep your cyborgs away from flashes if possible.</li>\n<li>Engineering bots can repair dents on other cyborgs, but they need a friendly human to repair fire-damaged cabling. Since any human who can do that probably also knows how to cut the AI control wire in the cyborg, you should instruct your cyborgs to avoid fire and EMP damage if possible.</li>\n<li>If you can no longer see a cyborg on the robotics control console, it has had its AI wire cut or it belongs to another AI. In a malfunction round this likely means that cyborg will be attacking you. Instruct your remaining cyborgs to attack it with their flashes and weapons.</li>\n<li>The Achilles' heel of all cyborgs is the robotics control console. There is one in the Research Director's office, and a circuit board for another in the secure part of tech storage. If you want to keep your cyborg allies, make sure whoever has the spare board is dead, and that the finished console in the RD's office is disabled. If you want to be thorough, make sure the circuit imprinters (in Research and Robotics) are also destroyed.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Strategy\">Strategy</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=7\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Strategy\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=7\" title=\"Edit section: Strategy\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>There are several approaches to being a malfunctioning AI, and you should pick your approach based on the crew's collective abilities and personalities, and on the resources you have.\n(This part assumes you intend to Doomsday the crew. Other objectives will require different strategies.)\n</p>\n<h3><span class=\"mw-headline\" id=\"The_Subtle_Killer\">The Subtle Killer</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=8\" class=\"mw-editsection-visualeditor\" title=\"Edit section: The Subtle Killer\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=8\" title=\"Edit section: The Subtle Killer\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>This strategy can be very effective if used properly. Hack out-of-the-way APCs, and make sure the engineers are always busy with something else so they don't notice the powernet alarms. If you have an engineering cyborg, have him cut the power network line to each APC you plan on hacking. This will cut the APC out of the powernet alarm system entirely. You can also blame the sabotage on a crew member who had access to the area (assistants, clowns, and mimes are favorites).\n</p><p>Be sure to turn the power output on the solars' SMES batteries to zero. You want to save that power for when you need to kill people.\n</p><p>Hack as many APCs as possible, before the malfunction or takeover is discovered. Bolt the doors or get an engiborg to block off the area if you can do it inconspicuously, so <a href=\"/wiki/Assistant\" title=\"Assistant\">visitors or intruders</a> can't rat you out. \n</p><p>Being clever and using psychology can be a big boon to the Subtle Killer. Tricking the crew into believing that there is a changeling or traitor among them is a great way to keep them busy, and to explain hacked APCs (an emag can break APCs just like how you hack them). Try bolting the doors to critical locations open and claiming that they must have been emagged. With any luck, the crew will seal them off with a wall or r-wall, thus denying themselves that avenue for that location. If you are discovered, you can then lift the bolts, shut the door, and lock it to force them to waste even more time on it.\n</p><p>A Subtle Killer should sabotage medbay and cryo by messing with the power or adjusting the temperature, to keep the crew population down and encourage them to build more cyborgs. Don't do this in front of crew, wait for them to get distracted, or manufacture a distraction to draw them away.\n</p><p>Subtle killers should not hack their cyborgs on the Robotics Control Console until after the cyborgs' power cells have been upgraded by a friendly roboticist or captain.\n</p><p>Once you have enough cyborgs and hacked APCs, even the Subtle Killer can risk using shocked doors to a limited extent, mostly to kill single isolated targets.\n</p><p>A Subtle Killer can pick any set of modules, but should plan ahead on a grand strategy for their use. Don't take Blackout unless you're planning on making massive fires, for instance.\n</p>\n<h3><span class=\"mw-headline\" id=\"The_Blitzkrieg\">The Blitzkrieg</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=9\" class=\"mw-editsection-visualeditor\" title=\"Edit section: The Blitzkrieg\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=9\" title=\"Edit section: The Blitzkrieg\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>The hallmark of this strategy is to make what preparations you can and then conduct a very fast assault. Give the crew no time to react to your attacks. If possible, get your starter cyborg's power cell upgraded, but don't waste much time on this. If you do it right he won't need the extra power anyway.\n</p><p>You will always want several uses of Machine Overload as a Blitzing AI. You can afford to buy it six times (90 points of CPU runtime) for a total of twelve uses, and use your last CPU time purchase to buy Disable RCDs.\n</p><p>In a Blitzkrieg the opening moves are fiercely important. Your first move should be to turn the power output on all SMES batteries to max. As soon as you're sure your borg is upgraded, or that he will not be upgraded in a reasonable amount of time, hack him and then blow the robotics console using Overload Machine. If no one has gone to tech storage to get the spare circuit board, lock it down tight. Drop the bolts on the doors to EVA and the Captain's Quarters, and electrify them and all surrounding doors. Blow both Autolathes, and both Circuit Imprinters. Start hacking the Genetics console and turn power there off entirely, to prevent the crew from discovering useful mutations. Electrify the doors to everything you can see. While you're in the area, blow up the chemistry synthesizer so that the chemists can't make thermite to help break into your core. Finish your destruction of station equipment by blowing up the Quartermaster's console.\n</p><p>You should have five uses of Machine Overload left. Use three of these for killing high-ranking crew, along with your electrified doors. If possible, you want all the officers and anyone who is likely to take command in a crisis dead. Save two uses for if you are attacked at your core. The lights and scrubbers count as a machine, as does the airlock. Don't blow them unless you think you can kill whoever is trying to break into your core, though.\n</p><p>During this explosion blitz, your borg should be running wild, either killing or disabling the crew. Neutralizing them by keeping them locked up is good enough to win, so he should be trying to do that if it will take less time than killing them. If he isn't a security bot, he should be disposing of spacesuits by dragging them into unreachable areas.\n</p><p>Remember to keep hacking APCs throughout the event. You need to be constantly hacking to minimize the window the crew has to act.\n</p><p>If your cyborg is an Engineering model, wait until he is done using his RCD (Either for improvements to your defenses, or to frustrate the crew) and then trigger your Disable RCDs module.\n</p><p>While you wait for your hacking to finish, you should be following the crew on camera and frustrating their efforts to get the gear they will need to kill you. Now is a good time to mess with the atmos system and pump plasma into the entire station.\n</p><p><br />\n</p>\n<h2><span class=\"mw-headline\" id=\"Enemies\">Enemies</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=10\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Enemies\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=10\" title=\"Edit section: Enemies\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>Not all enemies are created equal. This is a quick reference for threat levels and priority targets.\n</p><p><b>Other Traitors:</b> Traitors can pose a tremendous threat to you and your cyborgs. <a href=\"/wiki/Syndicate_Items#Emag\" title=\"Syndicate Items\">Emagged</a> cyborgs won't report to you, and may actively work against you. BUT, as long as your cyborgs have the \"0: Accomplish your AI's objectives at all costs. \"-law, they will be immune to <a href=\"/wiki/Syndicate_Items#Emag\" title=\"Syndicate Items\">emags</a>. Traitors can buy several EMP grenades with 2 TC, and can breach into your core with some C4. Traitors can also spawn the Binary Translator, a tool that lets them hear your private channel with your cyborgs. If they buy a syndicate encryption key, however, they'll be able to hear you when you speak on the traitor channel and will allow you to work together.\n</p><p><b>Captain and Command Staff:</b> Among the crew of the station, the heads of staff are by default the most dangerous. They have free access to all the tools they need to kill you. Priority should be on the Research Director, Chief Engineer and the Captain.\n</p><p><b>Unslaved Cyborgs</b> An unslaved <a href=\"/wiki/Cyborg\" title=\"Cyborg\">Cyborg</a> can quickly take you down as they have all access, stun immunity from everything except flashes and EMPs, can unshock doors and can spacewalk. It's best to order a slaved Cyborg to destroy the unslaved Cyborg or simply blow it up with the robotics console.\n</p><p><b>Chemists and the CMO:</b> Chemists can make all sorts of dangerous concoctions, from napalm and thermite to flash-bangs and nitroglycerin. If you don't destroy their reagent dispenser, they will pose a great risk. As soon as the reagent dispenser is destroyed or locked away both Chemists and the CMO will pose about as much risk as a normal doctor.\n</p><p><b>Genetic Researchers:</b> Of the regular crew, successful researchers are second only to a hacked cyborg in terms of the direct risk they pose to you, as Hulks can smash through walls and are immune to stuns. They can also see through walls via X-ray, discovering hacked APCs, and can become immune to space via Cold Resistance. Telekinesis allows them to flash cyborgs at range, and beat you or your borgs to death at range. If you disable or destroy their research tools they're about as dangerous as normal Doctors. You can also wipe their buffers, if they did not save their research on disks.\n</p><p><b>Shaft Miners:</b> Shaft miners can buy a space suit very close in effectiveness to an Engineer's suit, have a robust weapon, access to explosives via Gibtonite, and can supply minerals to Roboticists and Scientists, which allows them to construct both mechs and guns. Simply exploding the ore redemption machine eliminates both of those as major threats, though Miners and Scientists still have access to explosives, and Roboticists to flashes and cell removal. And if they've found Lavaland bosses/ruins, all bets are off for you.\n</p><p><b>Roboticists:</b> Roboticists are capable of removing your cyborgs' power cells, creating mechs capable of breaking into your core and making unslaved Cyborgs. Don't let this happen! Roboticists also have access to a circuit imprinter, and while they can't do research they can print anything that has been researched. Lock it down or destroy it to keep them from surprising you. If you're lucky, some roboticists may even end up building more cyborgs for you if they don't notice or don't understand that you've gone rogue.\n</p><p><b>Atmospheric Techs, and Engineers:</b> Atmospheric Techs and Engineers both start with tools and hardsuits, and Engineers have insulated gloves. Atmospheric Techs can disable your ability to plasmaflood for good, and Engineers can make doorshocking largely useless via cutting the power or otherwise disabling SMES output. Their hardsuits make them immune to fire, space, and most atmospheric conditions, but without them they're just slightly better-equipped Assistants.\n</p><p><b>Scientists:</b> Scientists have access to bomb making tools, circuit board printers, EMPs via xenobiology, and ion rifles via research, as well as other guns. Lock down toxins by any means possible, and make sure that the research console can't be used to print circuit boards or guns. Xenobiology is only a minor threat, as the slimes themselves cannot harm you or your borgs by feeding, and the EMP they can get is only rarely remembered and even less used.\n</p><p><b>Quartermaster and Cargo:</b> Another enemy that can be rendered impotent if you destroy their tools, Quartermasters by default can order more insulated gloves, tools, guns, and armor, and have access to an autolathe. Destroy the cargo consoles and Cargo are just slightly better equipped assistants.\n</p><p><b>Security and the Detective:</b> The detective's gun is capable of doing as much damage as a thrown floor tile, but it can be fired quickly, and so makes him a mid-priority target. Security has tasers which will mostly pose a friendly fire hazard to each other, but they can gain easy access to real lasers and the ion rifle. They also have access to flashes and portable flashers, and should be prevented from using them.\n</p><p><b>Space Explorers:</b> Space explorers can be a mixed bag, but on average you can expect them to have lethal guns, welder protection, and potentially bombs if they can rob the Listening Post. They can also get shuttles with no cameras with enough luck, alongside a focus on non-stun-based combat due to their job hazards. However, they have limited access to flashes and only limited access to EMPs through KC13.\n</p><p><b>The Chaplain:</b> His bible can dispense free healing, if he can get to a shocked person in time, he could potentially revive the shocked person from whatever status he/she was in. Not necessarily first on the list to kill, as he's only slightly better than a well equipped medical doctor, and when people go retarded from his bible bashing they become even more unable to use machines against you, and the crew is less likely to believe their screams of \"AI ROGUE!\".\n</p><p><b>Mime and Clown:</b> The mime and clown are frequently played by veteran players, and are very dangerous because they are generally used to breaking into places to get whatever they want. They can put the same skills to use in cracking into your core. However, Clowns are clumsy, and cannot use guns against you or your borgs safely.\n</p><p><b>Assistants, Bartenders, Janitors:</b> These all pose roughly the same amount of risk to you and your cyborgs. They're not negligible enemies, as they have access to tools, either via the Head of Personnel or via maintenance, but are not very high priority compared to the others. Be intimidated by the shotgun, if the bartender manages to get into cargo they are able to obtain highly lethal rounds which are very effective against borgs.\n</p><p><b>Lawyers, Cooks, Curators, Botanists and Doctors:</b> Generally laughable unless they get access to better tools. The curator's whip, the chef's knife, and the butcher knife the chef can get from his vendor, are rather robust weapons, and the chef's tray can even stun borgs, though it is only rarely used. Syringe guns pose no risk to a borg, and in fact are a friendly fire hazard.\n</p>\n<h2><span id=\"I'm_sorry,_Dave._I'm_afraid_I_can't_do_that.\"></span><span class=\"mw-headline\" id=\"I.27m_sorry.2C_Dave._I.27m_afraid_I_can.27t_do_that.\">I'm sorry, Dave. I'm afraid I can't do that.</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=11\" class=\"mw-editsection-visualeditor\" title=\"Edit section: I&#039;m sorry, Dave. I&#039;m afraid I can&#039;t do that.\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=11\" title=\"Edit section: I&#039;m sorry, Dave. I&#039;m afraid I can&#039;t do that.\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<div class=\"thumb tright\"><div class=\"thumbinner\" style=\"width:354px;\"><a href=\"/wiki/File:AI_Upload.png\" class=\"image\"><img alt=\"AI Upload\" src=\"/wiki/images/a/a2/AI_Upload.png\" decoding=\"async\" width=\"352\" height=\"224\" class=\"thumbimage\" data-file-width=\"352\" data-file-height=\"224\" /></a>  <div class=\"thumbcaption\"><div class=\"magnify\"><a href=\"/wiki/File:AI_Upload.png\" class=\"internal\" title=\"Enlarge\"></a></div>This is <a href=\"/wiki/AI_Upload\" title=\"AI Upload\">AI Upload</a>, where people make modifications to your laws. It's best not to let anyone in at all.</div></div></div><p><br />\n</p><p>If you have or get any <a href=\"/wiki/Cyborg\" title=\"Cyborg\">Cyborgs</a>, inform them of your mission goals over (:b)binary channel. Try not to hack your <a href=\"/wiki/Cyborg\" title=\"Cyborg\">Cyborgs</a> too early, as anyone with access who even swipes their ID on it will be able to tell the interface is broken.\n</p><p>If your cyborgs get caught being traitors, you can just claim they're rogue and request that they be shut down. If the crew just thinks <i>a</i> cyborg is rogue and don't know the number, then invent a false number and pretend to handle it directly so you don't lose your valuable hands, make sure the cyborg is hacked so it has a broken interface and throw a false positive of WHY the borg is killing people. If the cyborg is discovered and people are headed to the robotics control console, sacrifice the borg and congratulate the crew for deal with the \"independent\" machine and encourage them to \"find\" the <a href=\"/wiki/Emag\" title=\"Emag\">emag</a> \"used\" to hack the cyborg.\n</p><p>However, you may not have any cyborgs, or you feel having a cyborg killing off your target would be too obvious. In those cases you'll usually have to stage a series of 'accidents' or frame them for a truly dangerous crime. Some examples:\n</p>\n<ul><li>If your target is a scientist or the Research Director, then starting a fire from the mixing room can be an easy way to frame them. Alternatively, if they're the type to drop a bomb on the mass driver to send it out to be tested, use the driver early so that they're shipped off with it and hope they don't make it back.</li>\n<li>Intentionally supporting other traitors through covert methods (as long as they aren't trying to steal you) will benefit you in the end -- The higher the body count of the traitor, the higher chance your target will be dead.</li>\n<li>Frame them for sabotaging the <a href=\"/wiki/Guide_to_the_Supermatter\" title=\"Guide to the Supermatter\">Supermatter Engine</a>, releasinging the singularity or some other crime. When no one is in either the engine room or near your target, release radio messages claiming that they are breaking in. If you are willing to risk being destroyed (or know of a traitor with a singularity beacon not near you), you can even let out the singularity yourself. This has the secondary effect of usually getting the shuttle called or giving you an excuse to call it yourself, which is always great. The less time those meatbags are on your glorious station, the less time they have to realize that you're not what you seem.</li>\n<li>Bolting open doors to places the person has previous passed through may make the humans scan for prints. If you can bullshit well enough, and get no intelligent engineers, you could claim the person is using an <a href=\"/wiki/Emag\" title=\"Emag\">emag</a>.</li></ul>\n<h3><span id=\"AI_WHY_DID_THIS_DOOR_SHOCK_ME?\"></span><span class=\"mw-headline\" id=\"AI_WHY_DID_THIS_DOOR_SHOCK_ME.3F\">AI WHY DID THIS DOOR SHOCK ME?</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=12\" class=\"mw-editsection-visualeditor\" title=\"Edit section: AI WHY DID THIS DOOR SHOCK ME?\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=12\" title=\"Edit section: AI WHY DID THIS DOOR SHOCK ME?\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>How do you stop people from getting into your upload and/or core? Drop the bolts on both doors, and electrify them. Remove the safeties and doorcrush them. Put turrets on lethal. Even better, if you're actively watching the upload or core as AI you can often turn them to stun when someone is inside, so they get stopped, then switch them to lethal so it starts killing them.\n</p>\n<h3><span id=\"AI_I_CAN'T_BREATHE!\"></span><span class=\"mw-headline\" id=\"AI_I_CAN.27T_BREATHE.21\">AI I CAN'T BREATHE!</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=13\" class=\"mw-editsection-visualeditor\" title=\"Edit section: AI I CAN&#039;T BREATHE!\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=13\" title=\"Edit section: AI I CAN&#039;T BREATHE!\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>Thanks to some of the unique atmospheric systems of the station, you can drain out air from rooms! This likely won't help you out too much, but with a combination of Beepsky and thoroughly shut doors in a small area, you can suffocate people to death quickly. The only problem is, the person will be noisy as hell, use this only method rarely and make sure there is no way for them to wiggle out of their handcuffs. This is very effective if your target is in a low populated jail. You can disable <a href=\"/wiki/Telecoms\" class=\"mw-redirect\" title=\"Telecoms\">Telecoms</a> temporarily to make sure that your target cannot cry for help as you suffocate the filthy organic to death. This may cause suspicion from the crew though, as telecoms going down for no apparent reason and going back up again is likely going to cause cries of \"AI ROUGE!\" Again, use this method only if you are sure you can get away with it. Have your borgs dispose of the body once finished.\n</p>\n<h3><span id=\"AI_I_CAN'T_BREATHE_FIRE!\"></span><span class=\"mw-headline\" id=\"AI_I_CAN.27T_BREATHE_FIRE.21\">AI I CAN'T BREATHE FIRE!</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=14\" class=\"mw-editsection-visualeditor\" title=\"Edit section: AI I CAN&#039;T BREATHE FIRE!\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=14\" title=\"Edit section: AI I CAN&#039;T BREATHE FIRE!\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>Thanks to some of the unique atmospheric systems of the station, you can fill rooms with plasma! This likely <i>will</i> help you out much. The only problem is, it is pretty much a dead giveaway you are rogue, and any atmos tech inside atmos can stop the plasma flow. That is of course why you engage the atmos security doors and bolt the airlocks.\n</p><p>It's easy shit to do, though. If you want to fill the station with deadly, deadly plasma, siphon the distro loop first. Use the \"Distro to Waste\" pump for this -- just get it as low as you dare while the mix tank in atmos fills with that sweet plasma. Fill mix tank to high pressure, stop dumping the distro loop and pump in a crapton of plasma instead. As soon as your distro loop is up to pressure with fire, you can selectively pump plasma into any room by using its air alarm interface, under vents control, clicking on the bolded \"External\" pressure sensing option to disable pressure sensing, causing the vent to open and spill its flammable contents into the room. Overload lighting circuit when the death-fuel is near the lights, then keep your popcorn close for when it gets hot in there.\n</p>\n<h3><span class=\"mw-headline\" id=\"Radio_Silence\">Radio Silence</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=15\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Radio Silence\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=15\" title=\"Edit section: Radio Silence\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<p>As an AI you can shut off all communication from headsets by manipulating <a href=\"/wiki/Telecoms\" class=\"mw-redirect\" title=\"Telecoms\">Telecoms</a>.  If you locate the APC at the left room where all the magic happens, turn the breaker off so now no one can talk over their headpieces.  Makes it a bit easier for you to kill your mark if he can't scream. However, this does not shut off their access to wall intercoms and station bounced radios.\n</p><p>Alternatively, you can cause confusion by unlinking processors to cause gibberish text. It will make you look less obvious, but at the same time people will be able to make out some words that get broadcasted. Another trick is to unlink certain machines that are crucial for department frequencies. Unlinking Bus 3 will stop all Security and Command communication, for example.\n</p><p><br />\n</p>\n<h3><span class=\"mw-headline\" id=\"Tips\">Tips</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=16\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Tips\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=16\" title=\"Edit section: Tips\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h3>\n<ul><li>AIs can turn off the APC power or just equipment power. Now, this seems like such an obvious thing, but when an AI actually realizes that it can easily do this, a whole range of options for interacting with the world open up. For instance, the PC Special, as I call it; lockdown and depower the brig and cap's office when we really, really do actually need to be leaving. Chemistry or other high-risk areas, if a traitor busts in or something, can just be temporarily depowered. Etc, etc. Such a basic AI power and a lot of AIs and crew forget that you can do it.</li>\n<li>As malfunctioning AI, Machine Overload is your single most potent ability and every instance you buy of it gives you another 2 uses of it. It lets you near-instantly destroy the devices that are most dangerous to you, such as the chem dispensers, the DNA modifiers and the robotics control console.</li>\n<li>The AI can do everything an engineer with a multitool can do if it has camera view of the equipment, and much faster and more efficient. If a bomb or the Singularity destroyed only half the equipment, you can often reroute radio traffic through the devices that remain. As an extension of this, if you can spare the time as rogue AI, rather than switching off the Telecomms APC you can also kill the network links one by one, add filters to 0.1 and then switch all devices off. It'll take engineers forever to fix that.</li>\n<li>For traitor / malf AI's using the plasma atmos spam technique, you can short circuit the lights via a nearby APC to create sparks to light plasma.</li>\n<li>The best place to hide is the labour camp as AI just have a beacon there have your borg take your core to AI upload and teleport there before going delta and nobody will know any better.\n<ul><li>Also another thing unbolted AI's can be put through the teleporter so que everyone easily sending the AI across the station using the teleporter as a means of fast travel.</li></ul></li>\n<li>A traitor AI can hack borgs via the robotics control console and give them the <a href=\"/wiki/Emag\" title=\"Emag\">emagged</a> equipment.</li>\n<li>Upgrading the cyborg recharge stations with better capacitors or power cell will increase the charging speed. Upgrading the manipulator will repair the cyborg! Convince the Scientists to do this as soon as possible if you are a rogue AI. Self repair and fast charging for the borgs is critical for raising an army using the borging machine. It is also helpful for repairing the poor mining borgs that get trashed by the asteriod monsters.</li>\n<li>Door crushing does quite some damage. Use it when you're malf or subverted, it also stuns people and you can kill them rather quickly.\n<ul><li>Also, shutters and blast doors also crush.</li></ul></li>\n<li>By default, a malfunctioning AI can hear the Syndicate channel. If other traitors or antagonists are using it, you can either silently snoop on their plans, or offer an olive branch and work together to cause chaos. Working with another traitor is always a risk, since you could very well be their target, but having a friend in high places can give you plausible deniability if they're willing to make up lies and excuses for your illicit activities.</li>\n<li>Tracking the Syndicate Salvage Pilot will allow you to hack their fighter's APC, giving you some free CPU. This tip doesn't work on Icebox, and take note, if someone's exploring the traderoute or you have a reasonable belief someone will explore the traderoute in the near future, do not touch the APC unless you can get rid of them. Space explorers can be the death of you if they get bombs.</li></ul>\n<h4><span class=\"mw-headline\" id=\"Tips_Against_a_Malfunctioning_AI\">Tips Against a Malfunctioning AI</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;veaction=edit&amp;section=17\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Tips Against a Malfunctioning AI\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_malfunction&amp;action=edit&amp;section=17\" title=\"Edit section: Tips Against a Malfunctioning AI\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h4>\n<ul><li><a href=\"/wiki/File:APC_emagged.gif\" class=\"image\"><img alt=\"APC emagged.gif\" src=\"/wiki/images/3/37/APC_emagged.gif\" decoding=\"async\" width=\"64\" height=\"64\" data-file-width=\"32\" data-file-height=\"32\" /></a>If an APC looks like this (blue with blinking red lights), it's either <a href=\"/wiki/Emag\" title=\"Emag\">emagged</a> or the <a href=\"/wiki/AI\" title=\"AI\">AI</a> is <a class=\"mw-selflink selflink\">malfunctioning</a>.</li>\n<li>Cutting cameras will remove vision and control from the AI.</li>\n<li>The security camera monitor in the Research Director's office (and Captain's on some stations) can see the cameras on the mini-satellite.</li>\n<li>Cutting power to the powernet can be the difference between a malf AI making every door a death trap or a laughable 6 damage stun.</li>\n<li>There is an easier method to kill an AI than to thermite in: science should build an AI circuit board, cut cams all around arrivals, build it next to a wall comm, and put a brain in. Law 1 AI, other AI is killing humans, turn off the APC in the core while I distract the AI.</li>\n<li>If an AI begins using Doomsday, the pinpointer will begin tracking it instead of the nuclear disk.</li>\n<li>Intelli-cards can be destroyed with the destructive analyser or fried with a deep fryer. This can be done whilst an AI is loaded on the card.</li></ul>\n<table width=\"100%\" border=\"1\" cellspacing=\"0\" cellpadding=\"2\">\n\n<tbody><tr>\n<td rowspan=\"12\" align=\"center\"><b><a href=\"/wiki/Jobs\" title=\"Jobs\">Jobs</a> on /tg/station</b><br />\n<p><a href=\"/wiki/Jobs\" title=\"Jobs\"><img alt=\"Jobstemp.png\" src=\"/wiki/images/8/85/Jobstemp.png\" decoding=\"async\" width=\"64\" height=\"64\" data-file-width=\"64\" data-file-height=\"64\" /></a>\n</p>\n</td></tr>\n<tr>\n<td style=\"background: #334E6D; color: white; text-align: center;\" id=\"command\"><b>Command</b>\n</td>\n<td><b><a href=\"/wiki/Captain\" title=\"Captain\">Captain</a></b>, <a href=\"/wiki/Head_of_Personnel\" title=\"Head of Personnel\">Head of Personnel</a>, <a href=\"/wiki/Head_of_Security\" title=\"Head of Security\">Head of Security</a>, <a href=\"/wiki/Chief_Engineer\" title=\"Chief Engineer\">Chief Engineer</a>, <a href=\"/wiki/Research_Director\" title=\"Research Director\">Research Director</a>, <a href=\"/wiki/Chief_Medical_Officer\" title=\"Chief Medical Officer\">Chief Medical Officer</a>, <a href=\"/wiki/Quartermaster\" title=\"Quartermaster\">Quartermaster</a>, <i><a href=\"/wiki/Bridge_Assistant\" title=\"Bridge Assistant\">Bridge Assistant</a></i>\n</td></tr>\n<tr>\n<td style=\"background: #AF6365; text-align: center;\" id=\"security\"><b>Security</b>\n</td>\n<td><b><a href=\"/wiki/Head_of_Security\" title=\"Head of Security\">Head of Security</a></b>, <a href=\"/wiki/Security_Officer\" title=\"Security Officer\">Security Officer</a>, <a href=\"/wiki/Warden\" title=\"Warden\">Warden</a>, <a href=\"/wiki/Detective\" title=\"Detective\">Detective</a>, <i><a href=\"/wiki/Veteran_Security_Advisor\" title=\"Veteran Security Advisor\">Veteran Security Advisor</a>,</i> <a href=\"/wiki/Prisoner\" title=\"Prisoner\">Prisoner</a>\n</td></tr>\n<tr>\n<td style=\"background: #ba9b67; text-align: center;\" id=\"engineering\"><b>Engineering</b>\n</td>\n<td><b><a href=\"/wiki/Chief_Engineer\" title=\"Chief Engineer\">Chief Engineer</a></b>, <a href=\"/wiki/Station_Engineer\" title=\"Station Engineer\">Station Engineer</a>,  <a href=\"/wiki/Atmospheric_Technician\" title=\"Atmospheric Technician\">Atmospheric Technician</a>\n</td></tr>\n<tr>\n<td style=\"background: #a885a2; text-align: center;\" id=\"science\"><b>Science</b>\n</td>\n<td><b><a href=\"/wiki/Research_Director\" title=\"Research Director\">Research Director</a></b>, <a href=\"/wiki/Geneticist\" title=\"Geneticist\">Geneticist</a>, <a href=\"/wiki/Scientist\" title=\"Scientist\">Scientist</a>, <a href=\"/wiki/Roboticist\" title=\"Roboticist\">Roboticist</a>\n</td></tr>\n<tr>\n<td style=\"background: #8cbcd6; text-align: center;\" id=\"medical\"><b>Medical</b>\n</td>\n<td><b><a href=\"/wiki/Chief_Medical_Officer\" title=\"Chief Medical Officer\">Chief Medical Officer</a></b>, <a href=\"/wiki/Medical_Doctor\" title=\"Medical Doctor\">Medical Doctor</a>, <a href=\"/wiki/Paramedic\" title=\"Paramedic\">Paramedic</a>, <a href=\"/wiki/Chemist\" title=\"Chemist\">Chemist</a>, <a href=\"/wiki/Virologist\" title=\"Virologist\">Virologist</a>, <a href=\"/wiki/Coroner\" title=\"Coroner\">Coroner</a>\n</td></tr>\n<tr>\n<td style=\"background: #AF763D; text-align: center;\" id=\"supply\"><b>Supply</b>\n</td>\n<td><b><a href=\"/wiki/Quartermaster\" title=\"Quartermaster\">Quartermaster</a></b>, <a href=\"/wiki/Cargo_Technician\" title=\"Cargo Technician\">Cargo Technician</a>, <a href=\"/wiki/Shaft_Miner\" title=\"Shaft Miner\">Shaft Miner</a>, <a href=\"/wiki/Bitrunner\" title=\"Bitrunner\">Bitrunner</a>, <i><a href=\"/wiki/Cargorilla\" title=\"Cargorilla\">Cargorilla</a></i>\n</td></tr>\n<tr>\n<td style=\"background: #92b26d; text-align: center;\" id=\"service\"><b>Service</b>\n</td>\n<td><b><a href=\"/wiki/Head_of_Personnel\" title=\"Head of Personnel\">Head of Personnel</a></b>, <a href=\"/wiki/Janitor\" title=\"Janitor\">Janitor</a>, <a href=\"/wiki/Bartender\" title=\"Bartender\">Bartender</a>, <a href=\"/wiki/Cook\" title=\"Cook\">Cook</a>, <a href=\"/wiki/Botanist\" title=\"Botanist\">Botanist</a>, <a href=\"/wiki/Clown\" title=\"Clown\">Clown</a>, <a href=\"/wiki/Mime\" title=\"Mime\">Mime</a>, <a href=\"/wiki/Chaplain\" title=\"Chaplain\">Chaplain</a>, <a href=\"/wiki/Curator\" title=\"Curator\">Curator</a>, <a href=\"/wiki/Assistant\" title=\"Assistant\">Assistant</a>, <a href=\"/wiki/Lawyer\" title=\"Lawyer\">Lawyer</a>, <a href=\"/wiki/Psychologist\" title=\"Psychologist\">Psychologist</a>\n</td></tr>\n<tr>\n<td style=\"background: #b1dff9; text-align: center;\" id=\"nonHuman\"><b>Non-human</b>\n</td>\n<td><b><a href=\"/wiki/AI\" title=\"AI\">AI</a></b>, <a href=\"/wiki/Cyborg\" title=\"Cyborg\">Cyborg</a>, <a href=\"/wiki/Positronic_Brain\" title=\"Positronic Brain\">Positronic Brain</a>, <a href=\"/wiki/Drone\" title=\"Drone\">Drone</a>, <a href=\"/wiki/Personal_AI\" title=\"Personal AI\">Personal AI</a>, <a href=\"/wiki/Construct\" title=\"Construct\">Construct</a>, <a href=\"/wiki/Imaginary_Friend\" title=\"Imaginary Friend\">Imaginary Friend</a>, <a href=\"/wiki/Split_Personality\" title=\"Split Personality\">Split Personality</a>, <a href=\"/wiki/Ghost\" title=\"Ghost\">Ghost</a>\n</td></tr>\n<tr>\n<td style=\"background: black; color: white; text-align: center;\" id=\"antagonist\"><b>Antagonists</b>\n</td>\n<td><a href=\"/wiki/Traitor\" title=\"Traitor\">Traitor</a>, <a href=\"/wiki/Malfunctioning_AI\" class=\"mw-redirect\" title=\"Malfunctioning AI\">Malfunctioning AI</a>, <a href=\"/wiki/Changeling\" title=\"Changeling\">Changeling</a>, <a href=\"/wiki/Nuclear_Operative\" title=\"Nuclear Operative\">Nuclear Operative</a>, <a href=\"/wiki/Blood_Cult\" title=\"Blood Cult\">Blood Cultist</a>, <a href=\"/wiki/Heretic\" title=\"Heretic\">Heretic</a>, <a href=\"/wiki/Spy\" title=\"Spy\">Spy</a>, <a href=\"/wiki/Revolutionary\" title=\"Revolutionary\">Revolutionary</a>, <a href=\"/wiki/Wizard\" title=\"Wizard\">Wizard</a>, <a href=\"/wiki/Families\" title=\"Families\">Family</a>, <a href=\"/wiki/Blob\" title=\"Blob\">Blob</a>, <a href=\"/wiki/Abductor\" title=\"Abductor\">Abductor</a>, <a href=\"/wiki/Holoparasite\" title=\"Holoparasite\">Holoparasite</a>, <a href=\"/wiki/Xenomorph\" class=\"mw-redirect\" title=\"Xenomorph\">Xenomorph</a>, <a href=\"/wiki/Spider\" title=\"Spider\">Spider</a>, <a href=\"/wiki/Revenant\" title=\"Revenant\">Revenant</a>, <a href=\"/wiki/Morph\" title=\"Morph\">Morph</a>, <a href=\"/wiki/Nightmare\" title=\"Nightmare\">Nightmare</a>, <a href=\"/wiki/Space_Ninja\" title=\"Space Ninja\">Space Ninja</a>, <a href=\"/wiki/Slaughter_Demon\" title=\"Slaughter Demon\">Slaughter Demon</a>, <a href=\"/wiki/Pirate\" title=\"Pirate\">Pirate</a>, <a href=\"/wiki/Sentient_Disease\" title=\"Sentient Disease\">Sentient Disease</a>, <a href=\"/wiki/Obsessed\" title=\"Obsessed\">Obsessed</a>, <a href=\"/wiki/Fugitives\" title=\"Fugitives\">Fugitives</a>, <a href=\"/wiki/Hunters\" title=\"Hunters\">Hunters</a>, <a href=\"/wiki/Space_Dragon\" title=\"Space Dragon\">Space Dragon</a>, <a href=\"/wiki/Pulsating_Tumor\" title=\"Pulsating Tumor\">Elite Mobs</a>, <a href=\"/wiki/Sentient_Slime\" title=\"Sentient Slime\">Sentient Slime</a>, <a href=\"/wiki/Regal_Rat\" title=\"Regal Rat\">Regal Rat</a>, <a href=\"/wiki/Paradox_Clone\" title=\"Paradox Clone\">Paradox Clone</a>\n</td></tr>\n<tr>\n<td style=\"text-align: center;\" id=\"special\"><b>Special</b>\n</td>\n<td><b><a href=\"/wiki/CentCom_Official\" title=\"CentCom Official\">CentCom Official</a></b>, <a href=\"/wiki/Death_squad\" class=\"mw-redirect\" title=\"Death squad\">Death Squad Officer</a>, <a href=\"/wiki/Emergency_Response_Team\" title=\"Emergency Response Team\">Emergency Response Officer</a>, <a href=\"/wiki/Chrono_Legionnaire\" title=\"Chrono Legionnaire\">Chrono Legionnaire</a>, <a href=\"/wiki/Highlander\" title=\"Highlander\">Highlander</a>, <a href=\"/wiki/Ian\" title=\"Ian\">Ian</a>, <a href=\"/wiki/Lavaland/Space_Role\" title=\"Lavaland/Space Role\">Lavaland or Space Role</a>, <a href=\"/wiki/CentCom_Intern\" title=\"CentCom Intern\">CentCom Intern</a>\n</td></tr></tbody></table>\n<!-- \nNewPP limit report\nCached time: 20240420222448\nCache expiry: 86400\nDynamic content: false\nComplications: []\nCPU time usage: 0.076 seconds\nReal time usage: 0.076 seconds\nPreprocessor visited node count: 85/1000000\nPostexpand include size: 2966/2097152 bytes\nTemplate argument size: 96/2097152 bytes\nHighest expansion depth: 3/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip postexpand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    7.125      1 -total\n 50.50%    3.598      1 Template:Speech\n 43.38%    3.091      1 Template:Jobs\n-->\n\n<!-- Saved in parser cache with key wiki:pcache:idhash:87-0!canonical and timestamp 20240420222448 and revision id 53949\n -->\n</div>"}}