{"title":"Guide to Space Exploration","pageid":7322,"text":{"*":"<div class=\"mw-parser-output\"><table cellpadding=\"0\" cellspacing=\"0\" width=\"80%\" style=\"border: 1px solid #aaa; margin: 0 auto; display: block;\">\n\n<tbody><tr>\n<td width=\"10px\" style=\"background: #f4C340;\">\n</td>\n<td style=\"padding: 0 0 0 5px;\"><a href=\"/wiki/File:Pen.png\" class=\"image\"><img alt=\"Pen.png\" src=\"/wiki/images/4/4f/Pen.png\" decoding=\"async\" width=\"64\" height=\"64\" data-file-width=\"32\" data-file-height=\"32\" /></a>\n</td>\n<td style=\"padding: 10px 0 10px 5px;\"><font size=\"3\"><b>This page needs revising!</b></font>\n<p><font size=\"1\">The following page is out of date and/or needs to be revised. If the page's guide needs revision, <a href=\"/wiki/Guide_to_contributing_to_the_wiki#Guide_to_Writing_and_Revising_a_Guide\" title=\"Guide to contributing to the wiki\">see here for an example</a>.</font><br />The revision reason is: <b>\"i reworked this just but someone's gonna want to touch this up later\"</b>\n</p>\n</td></tr></tbody></table>\n<p><br />\n</p><p>So you want to explore space, huh? Better familarise yourself with <a href=\"/wiki/Z-level\" class=\"mw-redirect\" title=\"Z-level\">Z-levels</a> and everything you need to become a proper spaceman, as well as how to maximise your ruin-finding potential. Space exploration is not easy and can be frustrating, but you will get to explore areas infrequently visited and may get some incredibly rare items. Or you could die in seconds.\n</p>\n<div id=\"toc\" class=\"toc\" role=\"navigation\" aria-labelledby=\"mw-toc-heading\"><input type=\"checkbox\" role=\"button\" id=\"toctogglecheckbox\" class=\"toctogglecheckbox\" style=\"display:none\" /><div class=\"toctitle\" lang=\"en\" dir=\"ltr\"><h2 id=\"mw-toc-heading\">Contents</h2><span class=\"toctogglespan\"><label class=\"toctogglelabel\" for=\"toctogglecheckbox\"></label></span></div>\n<ul>\n<li class=\"toclevel-1 tocsection-1\"><a href=\"#Introduction_to_Space\"><span class=\"tocnumber\">1</span> <span class=\"toctext\">Introduction to Space</span></a></li>\n<li class=\"toclevel-1 tocsection-2\"><a href=\"#What_will_you_need.3F\"><span class=\"tocnumber\">2</span> <span class=\"toctext\">What will you need?</span></a></li>\n<li class=\"toclevel-1 tocsection-3\"><a href=\"#What.27s_a_Z-level.3F\"><span class=\"tocnumber\">3</span> <span class=\"toctext\">What's a Z-level?</span></a></li>\n<li class=\"toclevel-1 tocsection-4\"><a href=\"#Optimal_Strategy\"><span class=\"tocnumber\">4</span> <span class=\"toctext\">Optimal Strategy</span></a></li>\n<li class=\"toclevel-1 tocsection-5\"><a href=\"#Tips\"><span class=\"tocnumber\">5</span> <span class=\"toctext\">Tips</span></a></li>\n</ul>\n</div>\n\n<h2><span class=\"mw-headline\" id=\"Introduction_to_Space\">Introduction to Space</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;veaction=edit&amp;section=1\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Introduction to Space\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;action=edit&amp;section=1\" title=\"Edit section: Introduction to Space\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>Space has three qualities that make it harmful to human life - the lack of pressure, the freezing cold, and the lack of oxygen to breathe. In order to go out into space for any significant length of time, you will need to find solutions to these three problems. The lack of pressure and cold can be solved by an EVA suit, as these protect from lack of pressure and have integrated temperature regulators for keeping warm. However, the cell of the suit will eventually run dry and need to be replaced. But really, the suit can keep you warm for long shifts, and you can always snag a spare battery from around science before you leave if you're scared. The next problem is oxygen, and this can easily be solved with a basic internals mask and a large oxygen canister that can be found almost anywhere; it will fit in your suit storage and last for a very long time. Pack a jetpack too, and preferably find a canister to get your hands on more fuel. \n</p>\n<h2><span id=\"What_will_you_need?\"></span><span class=\"mw-headline\" id=\"What_will_you_need.3F\">What will you need?</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;veaction=edit&amp;section=2\" class=\"mw-editsection-visualeditor\" title=\"Edit section: What will you need?\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;action=edit&amp;section=2\" title=\"Edit section: What will you need?\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>Essential&#160;:\n</p>\n<ul><li>EVA suit - get from EVA. I beg of you, do not use a MODsuit. The cells run out stupidly fast.</li>\n<li>Oxygen - duh. Bring a space tank, there's a thousand emergency air tanks on the station and death by oxyloss is embarrassing.</li>\n<li>A <a href=\"/wiki/Research_items#GPS\" title=\"Research items\">GPS</a> - You do not \"space explore\" without this. The GPS tells you both where some interesting space ruins are, and where <b>you</b> are on a Z-level.</li>\n<li><a href=\"/wiki/Jetpack\" class=\"mw-redirect\" title=\"Jetpack\">Jetpack</a> - Get one from EVA.</li>\n<li>Oxygen/gas canister - If your jetpack runs out, you're fucked. DO NOT. FORGET. THIS.</li></ul>\n<p>Highly recommended&#160;:\n</p>\n<ul><li>Tools - You can find them in the Derelict in either the singularity wreckage and the south solar array. If possible, grab at least a crowbar before you leave for space - Many ruins are depowered and will have doors that need to be pried open.</li>\n<li><a href=\"/wiki/Clothing_and_Accessories#Combat_Gloves\" title=\"Clothing and Accessories\">Combat Gloves</a> - You can get them in Syndicate toolboxes, such as those in the Derelict - they allow you to fire guns, remove lights, AND greytide.</li>\n<li><a href=\"/wiki/Flashlight\" class=\"mw-redirect\" title=\"Flashlight\">Flashlight</a> - I mean, you could, but PDA light works perfectly.</li></ul>\n<p>Useful&#160;: \n</p>\n<ul><li>A retro laser gun - you can frequently find this in ruins.</li>\n<li>Meds - even the best space explorers take damage sometimes and it is best to go around at 100% HP when possible. These can sometimes be found in ruins. Try to grab a set of sutures from medbay before you leave, to patch up <s>bullet holes</s> space carp bites. Remember, sutures and pills require you to take off your space suite, patches go on OVER a space suit.</li>\n<li><a href=\"/wiki/Food\" class=\"mw-redirect\" title=\"Food\">Food</a> - If you find a pressurised ruin with food, chow down. If you're going all in on prep, Mothic ration bars from cargo are extremely nutriment-dense.</li></ul>\n<p>Easy mode&#160;:\n</p>\n<ul><li><a href=\"/wiki/Hand_teleporter\" class=\"mw-redirect\" title=\"Hand teleporter\">Hand teleporter</a>s make you the God of the void, able to hop between the White Ship and the station in seconds. ALWAYS get this if you can.</li></ul>\n<h2><span id=\"What's_a_Z-level?\"></span><span class=\"mw-headline\" id=\"What.27s_a_Z-level.3F\">What's a Z-level?</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;veaction=edit&amp;section=3\" class=\"mw-editsection-visualeditor\" title=\"Edit section: What&#039;s a Z-level?\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;action=edit&amp;section=3\" title=\"Edit section: What&#039;s a Z-level?\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<p>Z-levels are areas. Every time you leave one you are teleported to another. This z-level teleportation is random each round (like space ruin placement), but consistent within the round - so if you go far enough in one direction you will loop back around to where you started. \n</p><p>CentCom has its own z-level, Level 1, that cannot be accessed through space exploration because there's literally a pulse carbine there. The station should always be located on Level 2 - You can tell if you've drifted into it by the <s>terrifying</s> reassuring sight of lavaland in the background. Lavaland itself has its own Z-level, but it never connects into space - The only ways to access it are the mining shuttles, and Jacob's Ladders.\n</p><p>Notably, radio messages cannot transmit across z-levels and need a relay to link to the station's telecomms. Testing the radio once you cross into a new z-level (can be checked by looking at the 3rd number of your GPS location) can notify you of a ruin with an active relay in the z-level, or you can just hear someone. There are two ruins with a relay that starts active.\n</p>\n<h2><span class=\"mw-headline\" id=\"Optimal_Strategy\">Optimal Strategy</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;veaction=edit&amp;section=4\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Optimal Strategy\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;action=edit&amp;section=4\" title=\"Edit section: Optimal Strategy\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<ul><li>Spawn as assistant - nobody will give a shit.</li>\n<li>Break into EVA using a toolbox and some metal - the shutter button is your enemy. (THIS STRATEGY IS BROKEN BLAME CODERBUS, ASK THE AI INSTEAD)</li>\n<li>Get an EVA suit, helmet, a jetpack, and everything from a blue toolbox except the gas analyzer.</li>\n<li>Go to dorms, turn on one of the blue portable air pumps and set it to draw air from the environment. Let it run for a few seconds, then plug in your jetpack and set it to push air out. The jetpacks in EVA start with around 600 KPA of gas - This will top it out at around 2,500 KPA.</li>\n<li>Break into the teleporter, optimally secure the hand tele (unless the Captain already ran off with it like a scared bitch)</li>\n<li>Set it to 'Abandoned Teleporter' and use a handtele portal to get in so some dumbass doesn't wander through and fucking die.</li>\n<li>Get a GPS from the abandoned tele closet and set it to your name. For bonus points, build the broken teleporter here for a fast way home. Grab any rods (or loose metal sheets, to turn into rods), you can use them to place footholds in space, if your jetpack runs out.</li>\n<li>Hop between distant signals. If you see a few asteroids surrounded by carp and some shuttles, stay the fuck away unless you know what you're doing. That's the traderoute, and it doesn't have a signal for a reason.</li>\n<li>Focus on locating a Syndicate toolbox, meds, a retro laser gun, and a whiteship. These are some of the best items of loot in space. Or if you are very good at mauling simplemobs to death you can go to the Trade Route and snag a pirate's energy cutlass (BROKEN, BLAME CODERBUS), which is identical to an esword (but can't go rainbow), or, if you REALLY know what you're doing, you can loot the rightmost ship for a 40mm grenade launcher that can instantly win any fight. (Spare ammo is on the pirate cutter.)</li>\n<li>Return to station <s>and get mauled to death by shitcurity for having combat gloves</s> If you found a whiteship, you can send it back to the station's auxiliary port using the destination computer.</li></ul>\n<h2><span class=\"mw-headline\" id=\"Tips\">Tips</span><span class=\"mw-editsection\"><span class=\"mw-editsection-bracket\">[</span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;veaction=edit&amp;section=5\" class=\"mw-editsection-visualeditor\" title=\"Edit section: Tips\">edit</a><span class=\"mw-editsection-divider\"> | </span><a href=\"/wiki/index.php?title=Guide_to_Space_Exploration&amp;action=edit&amp;section=5\" title=\"Edit section: Tips\">edit source</a><span class=\"mw-editsection-bracket\">]</span></span></h2>\n<ul><li>If anything shoots you, either flee or dump a retro lasergun into it.</li>\n<li>Most basic mobs (blame coders) you find will be hostile, but you might occasionally find a friendly cat in an EVA suit.</li>\n<li>Many syndicate basic mobs (Generally labelled as 'Syndicate Operative') will only use bullet-firing guns on you. Glass windows and windowed doors block <i>their</i> bullets, but not <i>your</i> lasers. Until they break it, at least.</li>\n<li>On that note, syndicate basic mobs gib on death and destroy any 'equipment' they had on them, Don't go into a group fight while planning on scavenging their equipment.</li>\n<li>There are very few people in space. They are likely to be friendly, but if they've got a Syndicate MODsuit, go ham. If you find a corpse in space, you can be helpful and fling it <s>further into space</s> away from whatever wall it shored up against, hopefully back to the station.</li>\n<li>Whiteship placement computers (The ones that zoom you WAY out and show a flashing silhouette of the ship when you use them) can be used to scout of any ruins on the same Z-level as you.</li>\n<li>Ruins are often given a Distant Signal GPS. If you see one on Z-2 (station Z) you may want to investigate. If it's on Z-1, some serious adminbus is going on and you need to get the fuck to safety.</li>\n<li>If you space explore as an important role PLEASE MAKE SURE THAT THE STATION CAN OPERATE WITHOUT YOU.</li></ul>\n<!-- \nNewPP limit report\nCached time: 20240421072602\nCache expiry: 86400\nDynamic content: false\nComplications: []\nCPU time usage: 0.024 seconds\nReal time usage: 0.025 seconds\nPreprocessor visited node count: 49/1000000\nPost‐expand include size: 1456/2097152 bytes\nTemplate argument size: 431/2097152 bytes\nHighest expansion depth: 5/40\nExpensive parser function count: 0/100\nUnstrip recursion depth: 0/20\nUnstrip post‐expand size: 0/5000000 bytes\n-->\n<!--\nTransclusion expansion time report (%,ms,calls,template)\n100.00%    6.631      1 -total\n100.00%    6.631      1 Template:Needs_revision\n 46.56%    3.087      1 Template:Important\n-->\n\n<!-- Saved in parser cache with key wiki:pcache:idhash:7322-0!canonical and timestamp 20240421072602 and revision id 53860\n -->\n</div>"}}